target/test-classes/xml/selfcare/modifysubscription/TC53286_createOrder

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <ord1:createOrder type="NEW" xsi:schemaLocation="http://order.telco.hsntech.com ShopFront.xsd" xmlns:ord1="http://order.telco.hsntech.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <account type="RESIDENTIAL">
        <contact type="BILLING" language="en_GB">
          <title>Mr</title>
          <firstName>LINCOLN</firstName>
          <lastName>TURNIPSEED</lastName>
          <telephoneNumbers defaultContact="daytime">
            <daytime>0398403850</daytime>
            <evening>0208619999</evening>
            <mobile>02086999990</mobile>
          </telephoneNumbers>
          <emailAddress>tesco.testing@hsntech.com</emailAddress>
          <birthDate>1970-01-01</birthDate>
        </contact>
        <billingAddress>
          <buildingIdentifier>30</buildingIdentifier>
          <addressLine1>LUKIN STREET</addressLine1>
          <town>LONDON</town>
          <country>United Kingdom</country>
          <postcode>E10AA</postcode>
          <ptc_abs_code>PTCABS23599440</ptc_abs_code>
          <startDate>1980-08-08</startDate>
        </billingAddress>
        <accountDetail>
          <username>wkwan150529151913170353@hsntech.com</username>
          <password>password1</password>
          <securityQuestion>Mothers maiden name?</securityQuestion>
          <securityAnswer>smith</securityAnswer>
        </accountDetail>
        <billingDetail>
          <billGroupId>2</billGroupId>
          <preferredNotification>SMS</preferredNotification>
          <paymentDetail type="DD">
            <directDebit>
              <bankName>RGMSP8QI2</bankName>
              <sortCode>089999</sortCode>
              <accountNumber>66374958</accountNumber>
              <accountName>4SGD1U5IY</accountName>
            </directDebit>
          </paymentDetail>
          <billFormat>SUMMARY</billFormat>
          <clubcardNumber>634143330730912784</clubcardNumber>
        </billingDetail>
      </account>
      <verification runCreditCheck="true" termsAndConditionsAccepted="true" refundableDepositAccepted="false" acceptAgreement="true">
        <interconnect>
          <param name="PAYASYOUGO"/>
        </interconnect>
      </verification>
      <orderDetail orderRef="12345" ipAddress="160.206.234.22" salesChannel="Onlines" externalSystemID="COCO" devicePrint="DEVICEPRINT-AA" paymentMethod="CARD">
        <dateTime>2011-06-10T16:44:31.0Z</dateTime>
        <orderItem id="1" dealSKU="DEAL-INHAND">
          <serviceRef reference="Mobile FC"/>
          <tariff productCode="FC12-1000-500SO">
            <deliveryMethod>INHAND</deliveryMethod>
          </tariff>
          <device productCode="NK-2720">
            <deliveryMethod>DELIVER</deliveryMethod>
            <imei>143105812817067</imei>
            <serialNumber>123152436457568486784684</serialNumber>
          </device>
          <discBundle productCode="1GB-DATA-750-FC" bundleGroup="STANDARDDATAFC">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
          <discBundle productCode="02000-SB-A" bundleGroup="SB-GRP-A">
            <deliveryMethod>INHAND</deliveryMethod>
          </discBundle>
        </orderItem>
        <paymentRequest>
          <cardName>CardName</cardName>
          <cardNumber>5105105105105100</cardNumber>
          <cardType>MA</cardType>
          <cardExpiryDate>0130</cardExpiryDate>
          <cvv>123</cvv>
        </paymentRequest>
      </orderDetail>
    </ord1:createOrder>
  </soapenv:Body>
</soapenv:Envelope>